app/controllers/customers_controller.rb

SELECT "sms_providers".* FROM "sms_providers"
SELECT COUNT(*) FROM "customers"  WHERE "customers"."user_id" = $1  [["user_id", 1]]
---
  def new
    @customer = current_user.customers.new()
    @sms_providers = SmsProvider.all
    @customer_exists = (current_user.customers.count == 0 ? false : true)

SELECT  "customers".* FROM "customers"  WHERE "customers"."user_id" = $1  ORDER BY "customers"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "sms_providers".* FROM "sms_providers"
INSERT INTO "customers" ("bulk", "bulk_email", "clear_password", "created_at", "email", "label", "login", "md5_password", "password", "sender", "sms_provider_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    init_customer_view
    @error_message = ""
    @success_message = ""
    #@customer_exists = (current_user.customers.count == 0 ? false : true)
    @existing_customer = current_user.customers.first rescue nil
    @sms_providers = SmsProvider.all

    #if @customer_exists#@existing_customer != blank?
      #params[:customer][:login] = @existing_customer.login #rescue nil
      #params[:customer][:password] = 'duke'
      #params[:password_confirmation] = 'duke'
    #end

    @customer = Customer.new(params[:customer].merge({user_id: params[:customer][:user_id], md5_password: Digest::MD5.hexdigest(params[:customer][:password]), clear_password: params[:customer][:password]}))

    if params[:customer][:password] =! params[:password_confirmation]
      @error_message = "Le mot de passe et sa confirmation doivent être identiques<br />"
      @error_message = messages!(@error_message + @customer.errors.full_messages.map { |msg| "#{msg}<br />" }.join, "error")
    else
      if @customer.save &&  @error_message.blank?

SELECT  "customers".* FROM "customers"  WHERE "customers"."user_id" = $1 AND (id = 20)  ORDER BY "customers"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "sms_providers".* FROM "sms_providers"
---
  def edit
    @customer = current_user.customers.where("id = #{params[:customer_id]}").first rescue nil
    @sms_providers = SmsProvider.all

SELECT  "customers".* FROM "customers"  WHERE "customers"."user_id" = $1 AND (id = 21)  ORDER BY "customers"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "sms_providers".* FROM "sms_providers"
UPDATE "customers" SET "email_allowed" = $1, "sms_allowed" = $2, "sms_provider_id" = $3, "updated_at" = $4 WHERE "customers"."id" = 31  [["email_allowed", "f"], ["sms_allowed", "f"], ["sms_provider_id", 3], ["updated_at", "2019-02-03 12:21:15.539504"]]
---
  def update
    @error_message = ""
    @password = params[:customer][:password]
    @password_confirmation = params[:password_confirmation]
    @customer = current_user.customers.where("id = #{params[:customer][:id]}").first rescue nil
    @sms_providers = SmsProvider.all
    customer_params = params[:customer]
    if @customer.blank?
      @error_message = messages!("Le client n'a pas été trouvé", "error")
      render :list
    else
      if !@password.blank? || !@password_confirmation.blank?
        unless @password == @password_confirmation
          @error_message = messages!("Le mot de passe et sa confirmation doivent être identiques<br />", "error")
        end
      else
        customer_params.except!(:password, :id)
      end

      if @error_message.blank?
        if @customer.update_attributes(customer_params)

SELECT  "customers".* FROM "customers"  WHERE "customers"."user_id" = $1  ORDER BY id DESC LIMIT 25 OFFSET 0  [["user_id", 1]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "customers"  WHERE "customers"."user_id" = $1 LIMIT 25 OFFSET 0) subquery_for_count  [["user_id", 1]]
---
  def list
    init_customer_view
    @customers = current_user.customers.order("id DESC").page(params[:page])

SELECT "customers".* FROM "customers"  WHERE (email = '')
---
  def create_session
    @email = params[:email]
    @password = params[:password]

    @customer = Customer.where("email = ?", @email)

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = 31 LIMIT 1
UPDATE "customers" SET "clear_password" = $1, "updated_at" = $2 WHERE "customers"."id" = 31  [["clear_password", "didi"], ["updated_at", "2019-01-03 22:33:21.614861"]]
---
  def customer_update
    @error_message = ""
    @password = params[:customer][:clear_password]
    @password_confirmation = params[:clear_password_confirmation]
    customer_params = params[:customer]
    if !@password.blank? || !@password_confirmation.blank?
      unless @password == @password_confirmation
        @error_message = messages!("Le mot de passe et sa confirmation doivent être identiques<br />", "error")
      end
    else
      customer_params.except!(:clear_password, :id)
    end

    if @error_message.blank?
      if session[:customer].update_attributes(customer_params.merge(:password => Customer.find_by_id(session[:customer].id).password))