app/controllers/customer_messages_controller.rb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = 6 LIMIT 1
---
  def send_message
    @profile_id = params[:post][:profile_id]
    @message = params[:post][:message]
    @number = params[:post][:custom_number]
    @subscribers_file = params[:post][:subscribers_file]
    @error = false
    @error_status = 0

    validate_profile_id
    validate_message

    if session[:customer].sms_allowed == false
      @error = true
      @error_message = "Vous n'êtes pas autorisé à émettre des SMS. Veuillez contacter l'administrateur."
    end

    if session[:customer].bulk.to_i < 1
      @error = true
      @error_message = "Vous n'avez plus de SMS. Votre message n'a pas pu être envoyé."
    end

    unless @error
      @profile = Profile.find_by_id(@profile_id)

INSERT INTO "sms_transactions" ("created_at", "customer_id", "description", "number_of_messages", "profile_id", "sender_service", "started_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def set_transaction(description, subscribers_count)
    @transaction = SmsTransaction.create(started_at: DateTime.now, profile_id: @profile.id, description: description, number_of_messages: subscribers_count, sender_service: session[:customer].sender, service_id: @service_id, customer_id: session[:customer].id)