app/controllers/customer_message_logs_controller.rb

  def list
    @transactions_active = "active"
    @transaction = SmsTransaction.find_by_id(params[:transaction_id])
---
SELECT  "sms_transactions".* FROM "sms_transactions"  WHERE "sms_transactions"."id" = 84333 LIMIT 1

  def export
    book = Spreadsheet::Workbook.new
    sheet1 = book.create_worksheet
    sheet1.name = 'export'
    @transaction = SmsTransaction.find_by_id(params[:transaction_id])
---
SELECT  "sms_transactions".* FROM "sms_transactions"  WHERE "sms_transactions"."id" = 84333 LIMIT 1