app/controllers/customer_profiles_controller.rb

INSERT INTO "profiles" ("created_at", "customer_id", "name", "number_of_columns", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-02-09 22:56:24.825644"], ["customer_id", 31], ["name", "Argh1"], ["number_of_columns", 7], ["updated_at", "2019-02-09 22:56:24.825644"]]
SELECT "profiles".* FROM "profiles"  WHERE (name = 'Argh' AND customer_id = 31)
INSERT INTO "profile_data" ("created_at", "profile_id", "row_content", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-02-09 22:52:17.803338"], ["profile_id", 11], ["row_content", "22558908957.0|||||ae|"], ["updated_at", "2019-02-09 22:52:17.803338"]]
---
  def create
    @label = params[:name]
    @subscribers_file = params[:post][:subscribers_file] rescue nil
    @error = false
    @error_message = ""
    init_view

    validate_creation_params

    if @error
      params[:name] = params[:name]
      @error_message = messages!(@error_message, "error")

      render :new
    else
      parameter = Parameter.first
      @spreadsheet = Spreadsheet.open(@subscribers_file.path).worksheet(0)
      number_of_columns = @spreadsheet.rows.max_by(&:size).count
      profile = session[:customer].profiles.create(name: @label, number_of_columns: number_of_columns, aliases: create_profile_header(number_of_columns))
      data_array = []

      @spreadsheet.each do |row|
        i = 0
        row_data = ""
        while i < number_of_columns
          row_data << %Q[#{row[i]}#{parameter.profile_separator}]
          i += 1
        end
        data_array << {profile_id: Profile.find_by_name(@label).id, row_content: row_data[0..-(parameter.profile_separator.length)]}
      end
      ProfileData.create(data_array)

SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" IS NULL LIMIT 1
SELECT  "profile_data".* FROM "profile_data"  WHERE (profile_id = 14)  ORDER BY "profile_data"."id" ASC LIMIT 1
---
  def finalize
    init_view
    parameter = Parameter.first
    @profile = Profile.find_by_id(params[:profile_id])
    @aliases = @profile.aliases.split(parameter.profile_separator) rescue Array.new(7)
    @sample_data = ProfileData.where("profile_id = #{@profile.id}").first.row_content.split(parameter.profile_separator)

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = 15 LIMIT 1
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
SELECT  "profile_data".* FROM "profile_data"  WHERE (profile_id = 15)  ORDER BY "profile_data"."id" ASC LIMIT 1
UPDATE "profiles" SET "aliases" = $1, "msisdn_column" = $2, "updated_at" = $3 WHERE "profiles"."id" = 13  [["aliases", "MSISDN|||||||"], ["msisdn_column", 0], ["updated_at", "2019-02-12 23:54:14.324577"]]
---
  def update
    init_view
    @profile = Profile.find_by_id(params[:profile_id])
    parameter = Parameter.first
    @sample_data = ProfileData.where("profile_id = #{@profile.id}").first.row_content.split(parameter.profile_separator)
    @aliases = ""

    i = 0
    while i < @profile.number_of_columns
      @aliases << (params["alias#{i}".to_sym]  rescue "") + parameter.profile_separator
      i += 1
    end

    if valid_aliases?
      msisdn_column_number = @aliases.split(parameter.profile_separator).index("MSISDN")
      @profile.update_attributes(aliases: @aliases, msisdn_column: msisdn_column_number)

SELECT  "profiles".* FROM "profiles"  WHERE (customer_id = 31)  ORDER BY id ASC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "profiles"  WHERE (customer_id = 31) LIMIT 25 OFFSET 0) subquery_for_count
---
  def list
    @profile_active = "active exp"
    @profile_current_id = "current"
    @list_profile_active_subclass = "this"

    @profiles = Profile.where("customer_id = #{session[:customer].id}").order("id ASC").page(params[:page])