app/controllers/customer_search_controller.rb

  def set_query_params
    message_logs_query = ""
    transaction_logs_query = ""
    if !@msisdn.blank?
      message_logs_query << "msisdn LIKE '%#{@msisdn.strip}%'"
      if !@begin_date.blank? and !@end_date.blank?
        message_logs_query << " AND created_at BETWEEN '#{@begin_date}' AND '#{@end_date}'"
      else
        if !@begin_date.blank?
          message_logs_query << " AND created_at > '#{@begin_date}'"
        end
        if !@end_date.blank?
          message_logs_query << " AND created_at < '#{@end_date}'"
        end
      end
      @message_logs = MessageLog.where(message_logs_query + " AND customer_id = #{session[:customer].id}")
      @message_logs_count = @message_logs.count
      @message_logs = @message_logs.page(params[:page])
    else
      if !@begin_date.blank? and !@end_date.blank?
        transaction_logs_query << "created_at BETWEEN '#{@begin_date}' AND '#{@end_date}'"
      else
        if !@begin_date.blank?
          message_logs_query << " AND created_at > '#{@begin_date}'"
        end
        if !@end_date.blank?
          message_logs_query << " AND created_at < '#{@end_date}'"
        end
      end
      @transaction_logs = SmsTransaction.where(transaction_logs_query + "#{transaction_logs_query.blank? ? '' : ' AND'}" + " customer_id = #{session[:customer].id}")
      @transaction_logs_count = @transaction_logs.count
      @transaction_logs = @transaction_logs.page(params[:page])
---
SELECT COUNT(*) FROM "sms_transactions"  WHERE ( AND customer_id = 31)
SELECT  "sms_transactions".* FROM "sms_transactions"  WHERE ( customer_id = 31) LIMIT 25 OFFSET 0