app/controllers/customer_transactions_controller.rb

  def list
    @transactions_active = "active"
    @transactions = session[:customer].sms_transactions.order("created_at DESC")
    @transactions_count = @transactions.count
    @transactions = @transactions.page(params[:page])
---
SELECT COUNT(*) FROM "sms_transactions"  WHERE "sms_transactions"."customer_id" = $1  [["customer_id", 31]]
SELECT  "sms_transactions".* FROM "sms_transactions"  WHERE "sms_transactions"."customer_id" = $1  ORDER BY created_at DESC LIMIT 25 OFFSET 0  [["customer_id", 31]]