app/controllers/messages_controller.rb

SELECT  "customers".* FROM "customers"  WHERE (login = 'PDIRECT' AND status IS NOT FALSE AND label = 'PARIONSDIRECT')  ORDER BY "customers"."id" ASC LIMIT 1
INSERT INTO "custom_logs" ("created_at", "message", "msisdn", "sender_service", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  1 AS one FROM "customers"  WHERE ("customers"."label" = 'PARIONSDIRECT' AND "customers"."id" != 17) LIMIT 1
---
  def filter_api_send_message
    @authentication_token = "0d1773a649e4c88bff44c49ec154615c"
    @message = params[:message]
    @number = params[:msisdn]
    @login = params[:login]
    @password = params[:password]
    @sender = params[:sender]
    @service_id = params[:service_id]
    @service = Customer.where("login = ? AND status IS NOT FALSE AND label = ?", @login, @service_id).first rescue nil

    CustomLog.create(sender_service: "#{@sender.to_s} | #{@login.to_s} | #{@password.to_s}", message: params[:message], msisdn: params[:msisdn])

    if @login.blank? && @password.blank? && @service.blank?

INSERT INTO "sms_transactions" ("created_at", "description", "number_of_messages", "profile_id", "sender_service", "service_id", "started_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def set_transaction(description, subscribers_count)
    @transaction = SmsTransaction.create(started_at: DateTime.now, profile_id: @profile.id, description: description, number_of_messages: subscribers_count, sender_service: @sender, service_id: @service_id)