app/controllers/profiles_controller.rb

  def create
    @label = params[:name]
    @subscribers_file = params[:post][:subscribers_file] rescue nil
    @error = false
    @error_message = ""
    init_view

    validate_creation_params

    if @error
      params[:name] = params[:name]
      @error_message = messages!(@error_message, "error")

      render :new
    else
      parameter = Parameter.first
      @spreadsheet = Spreadsheet.open(@subscribers_file.path).worksheet(0)
      number_of_columns = @spreadsheet.rows.max_by(&:size).count
      profile = current_user.profiles.create(name: @label, number_of_columns: number_of_columns, aliases: create_profile_header(number_of_columns))
      data_array = []

      @spreadsheet.each do |row|
        i = 0
        row_data = ""
        while i < number_of_columns
          row_data << %Q[#{row[i]}#{parameter.profile_separator}]
          i += 1
        end
        data_array << {profile_id: Profile.find_by_name(@label).id, row_content: row_data[0..-(parameter.profile_separator.length)]}
      end
      ProfileData.create(data_array)
---
INSERT INTO "profiles" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-02-05 23:30:28.120200"], ["name", "Didi"], ["updated_at", "2019-02-05 23:30:28.120200"], ["user_id", 1]]
SELECT "profiles".* FROM "profiles"  WHERE (name = '' AND user_id = 1)
INSERT INTO "profile_data" ("col1", "col2", "col5", "created_at", "profile_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["col1", "22558908957.0"], ["col2", "hu"], ["col5", "uer"], ["created_at", "2019-02-05 23:38:42.219566"], ["profile_id", 10], ["updated_at", "2019-02-05 23:38:42.219566"]]

  def finalize
    init_view
    parameter = Parameter.first
    @profile = Profile.find_by_id(params[:profile_id])
---
SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" IS NULL LIMIT 1