app/controllers/transactions_controller.rb

SELECT COUNT(*) FROM "sms_transactions"
SELECT  "sms_transactions".* FROM "sms_transactions"   ORDER BY created_at DESC LIMIT 25 OFFSET 0
---
  def list
    @transactions_active = "active"
    @transactions = SmsTransaction.all.order("created_at DESC")
    @transactions_count = @transactions.count
    @transactions = @transactions.page(params[:page])