app/controllers/users_controller.rb

UPDATE "users" SET "firstname" = $1, "lastname" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["firstname", "Mensah"], ["lastname", "Dietrich"], ["updated_at", "2018-12-02 17:04:52.537655"]]
---
  def update
    if !params[:firstname].blank? && !params[:lastname].blank?
      @user = current_user.update_attributes(firstname: params[:firstname], lastname: params[:lastname])